_posts/2014-09-21-Getting-information-about-named-tables-in-exported-org-files.html
---
title: Getting information about named tables in exported org-files
date: 2014/09/21 14:34:50
updated: 2014/09/21 14:34:50
categories: orgmode
tags: 
---


<p>
I have found that the names of tables typically get lost when you export an org-file to another format like html or pdf. Since we may use named tables as data sources, it can become unclear in the exported file what has happened, or which table data came from. In this post, we examine how to include the name of a table in exported html. Here are two named tables <code>tbl-1</code> and <code>tbl-2</code> that will form the beginning of our effort. 
</p>

<table id="tbl-1" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">x</th>
<th scope="col" class="right">y</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">1</td>
<td class="right">2</td>
</tr>

<tr>
<td class="right">2</td>
<td class="right">3</td>
</tr>
</tbody>
</table>

<p>
Another table, so we have something to work with later.
</p>

<table id="tbl-2" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">a</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">5</td>
</tr>

<tr>
<td class="right">3</td>
</tr>
</tbody>
</table>


<p>
Org-buffers get parsed into nested lists, with properties usually in plists. It will be convenient to get a list of the keys for an element, so we can tell what information we have on each element. Some code for this can be found here: <a href="http://www.emacswiki.org/emacs/mon-plist-utils.el">http://www.emacswiki.org/emacs/mon-plist-utils.el</a> . Rather than use that recursive approach, here we just loop through the plist and accumulate the keys.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="elisp-keys">(<span style="color: #8b0000;">defun</span> <span style="color: #8b2323;">plist-get-keys</span> (plist)
  (interactive)
  (<span style="color: #8b0000;">let</span> ((keys))
    (<span style="color: #8b0000;">while</span> (car plist)
      (add-to-list 'keys (car plist) t)
      (setq plist (cddr plist)))
    keys))

; <span style="color: #ff0000; font-weight: bold;">example of use</span>
(plist-get-keys '(<span style="color: #cd0000;">:a</span> 1 <span style="color: #cd0000;">:b</span> 3 <span style="color: #cd0000;">:parent</span> '(another plist)))
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">:a</td>
<td class="left">:b</td>
<td class="left">:parent</td>
</tr>
</tbody>
</table>


<p>
Now, when we parse a buffer for elements, we get a nested lisp data structure, and the best I can tell is we need the cadr of that list to get to the relevant plist of properties. So, here, we map over the tables, and see what properties are available.
</p>


<div class="org-src-container">

<pre class="src src-emacs-lisp">(org-element-map
    (org-element-parse-buffer) 'table
  (<span style="color: #8b0000;">lambda</span> (element)  (plist-get-keys (cadr element))))
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">:begin</td>
<td class="left">:end</td>
<td class="left">:type</td>
<td class="left">:tblfm</td>
<td class="left">:contents-begin</td>
<td class="left">:contents-end</td>
<td class="left">:value</td>
<td class="left">:post-blank</td>
<td class="left">:post-affiliated</td>
<td class="left">:name</td>
<td class="left">:parent</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">:begin</td>
<td class="left">:end</td>
<td class="left">:type</td>
<td class="left">:tblfm</td>
<td class="left">:contents-begin</td>
<td class="left">:contents-end</td>
<td class="left">:value</td>
<td class="left">:post-blank</td>
<td class="left">:post-affiliated</td>
<td class="left">:name</td>
<td class="left">:parent</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">:begin</td>
<td class="left">:end</td>
<td class="left">:type</td>
<td class="left">:tblfm</td>
<td class="left">:contents-begin</td>
<td class="left">:contents-end</td>
<td class="left">:value</td>
<td class="left">:post-blank</td>
<td class="left">:post-affiliated</td>
<td class="left">:results</td>
<td class="left">:parent</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">:begin</td>
<td class="left">:end</td>
<td class="left">:type</td>
<td class="left">:tblfm</td>
<td class="left">:contents-begin</td>
<td class="left">:contents-end</td>
<td class="left">:value</td>
<td class="left">:post-blank</td>
<td class="left">:post-affiliated</td>
<td class="left">:caption</td>
<td class="left">:parent</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">:begin</td>
<td class="left">:end</td>
<td class="left">:type</td>
<td class="left">:tblfm</td>
<td class="left">:contents-begin</td>
<td class="left">:contents-end</td>
<td class="left">:value</td>
<td class="left">:post-blank</td>
<td class="left">:post-affiliated</td>
<td class="left">:name</td>
<td class="left">:caption</td>
<td class="left">:parent</td>
</tr>

<tr>
<td class="left">:begin</td>
<td class="left">:end</td>
<td class="left">:type</td>
<td class="left">:tblfm</td>
<td class="left">:contents-begin</td>
<td class="left">:contents-end</td>
<td class="left">:value</td>
<td class="left">:post-blank</td>
<td class="left">:post-affiliated</td>
<td class="left">:results</td>
<td class="left">:parent</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
Depending on when you run the codeblock above (i.e. I ran it at different stages of development of this document, so some tables after this point are shown), you see different results; some of the tables are RESULTS from code blocks with no names, and two tables have a caption.  
</p>

<p>
Let us now map over the tables and see if they have names. We add an unnamed table, and a named table, both with captions.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> an unnamed table of category counts.</caption>

<colgroup>
<col  class="left" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">category</th>
<th scope="col" class="right">count</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">emacs</td>
<td class="right">4</td>
</tr>

<tr>
<td class="left">orgmode</td>
<td class="right">3</td>
</tr>
</tbody>
</table>

<table id="python-table" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 2:</span> an named table of category counts on python.</caption>

<colgroup>
<col  class="left" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">category</th>
<th scope="col" class="right">count</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Python</td>
<td class="right">4</td>
</tr>

<tr>
<td class="left">pep8</td>
<td class="right">3</td>
</tr>
</tbody>
</table>

<p>
Here we get the names of the tables. Only three tables have names, and several are unnamed.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(org-element-map
    (org-element-parse-buffer) 'table
  (<span style="color: #8b0000;">lambda</span> (element)  (plist-get (cadr element) <span style="color: #cd0000;">:name</span>)))
</pre>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">tbl-1</td>
<td class="left">tbl-2</td>
<td class="left">python-table</td>
</tr>
</tbody>
</table>


<p>
If you think that is a little awkward, I agree. Here is probably a better way to get that information using features in org-mode..
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(org-element-map
    (org-element-parse-buffer) 'table
  (<span style="color: #8b0000;">lambda</span> (element)  (org-element-property <span style="color: #cd0000;">:name</span> element)))
</pre>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">tbl-1</td>
<td class="left">tbl-2</td>
<td class="left">python-table</td>
</tr>
</tbody>
</table>


<p>
I had thought we could use a <a href="http://orgmode.org/manual/Advanced-configuration.html">filter</a> to add the name to each table. The issue with filtering is that we get the transcoded text directly, and no practical way to get back to the element it came from (at least none I could find). I have previously used filters (e.g. for <a href="http://kitchingroup.cheme.cmu.edu/blog/2013/09/28/Changing-links-to-files-so-they-work-in-a-blog/">changing links on export</a> ) for something like this, but it involved parsing the document once, then exporting, and iterating through the results to change the output. I want to do something different here, and fix the issue on the export. 
</p>

<p>
That requires us to derive a new backend for export, with our new function for formatting. This will give us access to the actual table element, and we can use the original transcoding function to get most of the table, and our own code to modify that before it is exported.
</p>

<p>
Basically, we just want to add an HTML anchor to the table with some text to indicate the table name. With the anchor we can then link to it elsewhere like this:
</p>

<a href="#tbl-2"> See tbl-2</a>

<p>
We just define a function that satisfies the transcoding function signature (element contents info), and if our element has a :name property, we will prepend it onto the usual table output for html. We will go ahead and code in some conditional code for different backends, although for now only handle the html backend.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8b0000;">defun</span> <span style="color: #8b2323;">my-table-format</span> (table contents info)
  (<span style="color: #8b0000;">let</span> ((tblname (org-element-property <span style="color: #cd0000;">:name</span> table)))    
    (<span style="color: #8b0000;">cond</span>
     ((eq (elt (plist-get info <span style="color: #cd0000;">:back-end</span>) 2) 'html)  
      (concat
       (<span style="color: #8b0000;">when</span> tblname
         (format <span style="color: #228b22;">"&lt;br&gt;TBLNAME: &lt;a name=\"%s\"&gt;&lt;/a&gt;%s&lt;br&gt;"</span> tblname tblname))
       (org-html-table table contents info))))))

(org-export-define-derived-backend 'my-html 'html
  <span style="color: #cd0000;">:translate-alist</span> '((table . my-table-format)))


(browse-url (org-export-to-file 'my-html <span style="color: #228b22;">"custom-src-table-export.html"</span>))
</pre>
</div>

<pre class="example">
#&lt;process open custom-src-table-export.html&gt;
</pre>

<p>
That seems to do it. You may need to see <a href="/media/2014-09-21-Getting-information-about-named-tables-in-exported-org-files/custom-src-table-export.html">custom-src-table-export.html</a> to see the newly annotated tables, since they probably do not show up in the blog post.</p>
<p>Copyright (C) 2014 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2014/09/21/Getting-information-about-named-tables-in-exported-org-files.org">org-mode source</a><p><p>Org-mode version = 8.2.7c</p>